//Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
//6 -> да
//7 -> да
//1 -> нет

Console.WriteLine("Введите число");
int num = Convert.ToInt32(Console.ReadLine());
//Согласно заданию, проверки на существование номера недели нет, но если он нужен, нужно просто раскомментировать условие
//if (num < 1 || num > 7) Console.WriteLine("Дня недели с таким номером нет");
//else

{
    if (num >5 && num < 8)
    {
        Console.WriteLine("Да");
    }
    else Console.WriteLine("Нет"); //Если не делать проверку на существование дня недели, то любой день кроме субботы и воскресенья можно считать не выходным. Хочется верить что это не будет ошибкой :D
}