// Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.

int[] array = new int[new Random().Next(2,11)]; // В задаче не описан размер массива, пускай сам решит 

int count = 0;

for (int a = 0; a < array.Length; a++) //Заполнение массива
{
    array[a] = new Random().Next(100,1000); //Присваивание каждому элементу массива 3-хзначного числа
    if (array[a] % 2 == 0) count ++; //Счетчик четных чисел
    Console.Write($"{array[a]}, "); //В задании вывода массива не требуется, просто чтобы проверить
}
Console.WriteLine(); //Перенос курсора на следующую строку
Console.WriteLine(count); //Вывод результата